Revit 2024 API
ConnectorProfileType Enumeration
 An enumerated type listing all connector profile types
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum ConnectorProfileType
Visual Basic
Public Enumeration ConnectorProfileType
Visual C++
public enum class ConnectorProfileType
Members
Member name | Description
Invalid |  Invalid connector profile
Round |  Round connector profile
Rectangular |  Rectangular connector profile
Oval |  Oval connector profile
See Also
Autodesk.Revit.DB Namespace